Revit 2024 API
Application.ShowGraphicalWarningPipeDisconnects Property
 Whether or not to show the graphical warnings for Pipe disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool ShowGraphicalWarningPipeDisconnects { get; set; }
Visual Basic
Public Property ShowGraphicalWarningPipeDisconnects As Boolean
	Get
	Set
Visual C++
public:
property bool ShowGraphicalWarningPipeDisconnects {
	bool get ();
	void set (bool value);
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace